import 'package:flutter/material.dart';
import 'package:wa3y/colors/app-colors.dart';

class LargeArticleScreen extends StatefulWidget {
  @override
  _LargeArticleScreenState createState() => _LargeArticleScreenState();
}

class _LargeArticleScreenState extends State<LargeArticleScreen> {
  Color _textColor = darkColor.withOpacity(0.95);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("مخاطر البسطرمة"),
      ),
      body: SingleChildScrollView(
        physics: BouncingScrollPhysics(),
        child: Card(
          margin: EdgeInsets.symmetric(vertical: 20.0, horizontal: 8.0),
          clipBehavior: Clip.antiAlias,
          child: Container(
            color: whitishColor,
            padding: EdgeInsets.symmetric(vertical: 15.0, horizontal: 10),
            child: Column(
              children: <Widget>[
                SelectableText(
                  longString,
                  toolbarOptions: ToolbarOptions(
                      cut: false, copy: true, selectAll: true, paste: false),
                  strutStyle: StrutStyle(height: 2.0, forceStrutHeight: true),
                  style: TextStyle(color: _textColor, fontSize: 16.0),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}

/////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////  Habd Text ///////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////
String longString = """
غاليليو. هي أربعة أقمار تابعة لكوكب المشتري اكتشفها جاليليو جاليلي في يناير عام 1610 للميلاد. هذه الأقمار هي أكبر أقمار كوكب المشتري وتم اشتقاق أسمائهم
131 KB (15,318 words) - 19:45, 14 September 2019
أقمار المشتري
مدار كوكب المشتري والتي مع الأقمار الباقية والحلقات المدارية تشكل فقط ما نسبته 0،003% من مجموع الكتلة الدائرة. الترتيب حسب بعدها عن المشتري يرمز الترتيب
33 KB (608 words) - 06:51, 5 September 2019
مستكشف أقمار المشتري الجليدية
تطويره، وهدفه زيارة نظام المشتري بحلول عام 2030 وسيركز بشكل أساسي على دراسة أقمار جانيميد وكاليستو وأوروبا التابعة للمشتري، إضافةً إلى محاولته الوصول
15 KB (1,172 words) - 11:29, 5 September 2019
أقمار غاليليو
أقمار غاليليو هي أربعة أقمار تابعة لكوكب المشتري اكتشفها جاليليو جاليلي في يناير عام 1610 للميلاد. هذه الأقمار هي أكبر أقمار كوكب المشتري وتم اشتقاق أسمائهم
3 KB (162 words) - 20:28, 8 August 2019
آيسونوي (redirect from المشتري السادس والعشرون)
ينتمي هذا القمر إلى مجموعة كارم المكونة جميعها من أقمار غير نظامية وتتحركة بحركة تراجعية دائرة حول المشتري على مسافة تتراوح بين 23 و24 جيجامتر وزاوية ميلان
3 KB (209 words) - 12:03, 5 September 2019
إرينوم (redirect from المشتري الخامس والعشرون)
ينتمي هذا القمر إلى مجموعة كارم المكونة جميعها من أقمار غير نظامية وتتحركة بحركة تراجعية دائرة حول المشتري على مسافة تتراوح بين 23 و24 جيجامتر وزاوية ميلان
3 KB (254 words) - 12:53, 5 September 2019
أورثوسي (قمر) (redirect from المشتري الخامس والثلاثون)
المعروف أيضاً بإسم المشتري الخامس والثلاثون (بالإنجليزية: Jupiter XXXV) ، هو قمر طبيعي غير نظامي يتحرك بحركة تراجعية تابع لكوكب المشتري. و ينتمي هذا القمر
3 KB (228 words) - 15:13, 5 September 2019
إيوانث (redirect from المشتري الثالث والثلاثون)
المعروف أيضاً باسم المشتري الثالث والثلاثون (بالإنجليزية: Jupiter XXXIII)، هو قمر طبيعي غير نظامي يتحرك بحركة تراجعية تابع لكوكب المشتري. و ينتمي هذا القمر
3 KB (218 words) - 15:17, 5 September 2019
مجموعة أنانك (category أقمار المشتري)
مجموعة من الأقمار غير النظامية التي تتحرك بحركة تراجعية تابعة لكوكب المشتري و تتبع جميعها مدارات مشابهة للقمر أنانك ويعتقد أن جميع هذه الأقمار لها أصل مشترك
3 KB (212 words) - 23:05, 5 September 2019
باسيثي (redirect from المشتري الثامن والثلاثون)
وينتمي هذا القمر إلى مجموعة كارم المكونة جميعها من أقمار غير نظامية وتتحرك بحركة تراجعية دائرة حول المشتري على مسافة تتراوح بين 23 و 24 جيجامتر وزاوية ميلان
2 KB (181 words) - 22:50, 5 September 2019
قمر غير نظامي (redirect from أقمار غير نظامية)
الكواكب الأربعة العملاقة المشتري وزحل وأورانوس ونبتون. وقبل هذا العام كانت قد اكتشفت عشرة أقمار فقط، من ضمنها فويب أكبر الأقمار غير النظامية حول زحل وهيمالايا
3 KB (259 words) - 10:40, 5 September 2019
إيريدومي (redirect from المشتري الثاني والثلاثين)
هذا القمر إلى مجموعة باسيفي المكونة جميعها من أقمار غير نظامية وتتحرك بحركة تراجعية دائرة حول المشتري على مسافة تتراوح بين 22.8 و 24.1 جيجامتر وزاوية
3 KB (223 words) - 12:16, 5 September 2019
مهمة نظام أوروبا المشتري - لابليس
يطلق تقريباً في سنة 2020 لاستكشاف أقمار المشتري مع التركيز على القمرين أوروبا وغانيميد إضافة إلى الغلاف المغناطيسي للمشتري. صرحت وكالة الفضاء الأوروبية في
3 KB (276 words) - 09:17, 7 September 2019
باسيفي (قمر) (category أقمار المشتري)
تراجعية تابع لكوكب المشتري. و ينتمي هذا القمر إلى مجموعة باسيفي المكونة جميعها من أقمار غير نظامية و تتحرك بحركة تراجعية دائرة حول المشتري على مسافة تتراوح
7 KB (641 words) - 21:24, 5 September 2019
أويدي (قمر) (redirect from المشتري الحادي والأربعون)
هذا القمر إلى مجموعة باسيفي المكونة جميعها من أقمار غير نظامية وتتحرك بحركة تراجعية دائرة حول المشتري على مسافة تتراوح بين 22.8 و 24.1 جيجامتر وزاوية
3 KB (237 words) - 19:54, 30 July 2019
غلاف المشتري المغناطيسي
غلاف المشتري المغناطيسي أو الغلاف المغناطيسي للمشتري هو الغلاف المحيط بكوكب المشتري الناشئ عن مغناطيسية الكوكب والذي يتأثر بالرياح الشمسية. وهو يمتد إلى
74 KB (6,480 words) - 14:30, 1 August 2019
أدراستيا (redirect from المشتري الخامس عشر)
(بالإنجليزية: Adrastea) والمعروف أيضاً باسم المشتري الخامس عشر، هو ثاني أبعد قمر، وأصغر من أربعة أقمار  
""";
